results/4-loadtest/azure_win_results/azure_win_dotnet_200.txt
Running 1m test @ https://dotnet-matrix-windows-205-westeurope.azurewebsites.net/api/matrix
  2 threads and 200 connections
  Thread calibration: mean lat.: 899.644ms, rate sampling interval: 3014ms
  Thread calibration: mean lat.: 1092.028ms, rate sampling interval: 3708ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   423.39ms  312.90ms   5.84s    84.09%
    Req/Sec   100.34      4.58   108.00     79.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  390.65ms
 75.000%  556.03ms
 90.000%  695.81ms
 99.000%    1.33s 
 99.900%    3.89s 
 99.990%    5.69s 
 99.999%    5.84s 
100.000%    5.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      44.447     0.000000            1         1.00
     126.207     0.100000          993         1.11
     196.735     0.200000         1987         1.25
     260.607     0.300000         2977         1.43
     326.655     0.400000         3973         1.67
     390.655     0.500000         4964         2.00
     419.583     0.550000         5458         2.22
     450.815     0.600000         5956         2.50
     489.727     0.650000         6450         2.86
     525.311     0.700000         6951         3.33
     556.031     0.750000         7451         4.00
     570.879     0.775000         7700         4.44
     585.215     0.800000         7949         5.00
     601.599     0.825000         8191         5.71
     624.639     0.850000         8436         6.67
     656.895     0.875000         8683         8.00
     677.375     0.887500         8810         8.89
     695.807     0.900000         8938        10.00
     719.359     0.912500         9055        11.43
     749.055     0.925000         9180        13.33
     778.751     0.937500         9304        16.00
     799.231     0.943750         9365        17.78
     822.271     0.950000         9428        20.00
     849.407     0.956250         9489        22.86
     889.855     0.962500         9551        26.67
     935.423     0.968750         9613        32.00
     963.071     0.971875         9645        35.56
     991.743     0.975000         9675        40.00
    1046.015     0.978125         9706        45.71
    1114.111     0.981250         9738        53.33
    1192.959     0.984375         9768        64.00
    1210.367     0.985938         9784        71.11
    1255.423     0.987500         9800        80.00
    1316.863     0.989062         9815        91.43
    1455.103     0.990625         9830       106.67
    1700.863     0.992188         9846       128.00
    1704.959     0.992969         9854       142.22
    1878.015     0.993750         9861       160.00
    1889.279     0.994531         9870       182.86
    1898.495     0.995313         9880       213.33
    1901.567     0.996094         9885       256.00
    2016.255     0.996484         9889       284.44
    2469.887     0.996875         9892       320.00
    2783.231     0.997266         9896       365.71
    2904.063     0.997656         9900       426.67
    3053.567     0.998047         9905       512.00
    3061.759     0.998242         9906       568.89
    3729.407     0.998437         9908       640.00
    3842.047     0.998633         9910       731.43
    3864.575     0.998828         9912       853.33
    3891.199     0.999023         9914      1024.00
    3944.447     0.999121         9915      1137.78
    3958.783     0.999219         9916      1280.00
    4685.823     0.999316         9917      1462.86
    4689.919     0.999414         9919      1706.67
    4689.919     0.999512         9919      2048.00
    4689.919     0.999561         9919      2275.56
    4820.991     0.999609         9920      2560.00
    4820.991     0.999658         9920      2925.71
    4898.815     0.999707         9921      3413.33
    4898.815     0.999756         9921      4096.00
    4898.815     0.999780         9921      4551.11
    5685.247     0.999805         9922      5120.00
    5685.247     0.999829         9922      5851.43
    5685.247     0.999854         9922      6826.67
    5685.247     0.999878         9922      8192.00
    5685.247     0.999890         9922      9102.22
    5844.991     0.999902         9923     10240.00
    5844.991     1.000000         9923          inf
#[Mean    =      423.387, StdDeviation   =      312.898]
#[Max     =     5840.896, Total count    =         9923]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11802 requests in 1.00m, 3.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 16
Requests/sec:    196.33
Transfer/sec:     53.26KB