results/4-loadtest/azure_win_results/azure_win_node_50.txt
Running 1m test @ https://node-matrix-windows-322-westeurope.azurewebsites.net/api/matrix
  2 threads and 50 connections
  Thread calibration: mean lat.: 412.714ms, rate sampling interval: 1233ms
  Thread calibration: mean lat.: 295.632ms, rate sampling interval: 1078ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   334.57ms  180.57ms   1.20s    61.92%
    Req/Sec    24.64      4.13    35.00     80.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  347.90ms
 75.000%  480.00ms
 90.000%  541.18ms
 99.000%  780.29ms
 99.900%    1.16s 
 99.990%    1.20s 
 99.999%    1.20s 
100.000%    1.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      48.255     0.000000            1         1.00
      93.951     0.100000          251         1.11
     141.055     0.200000          499         1.25
     195.583     0.300000          748         1.43
     276.223     0.400000          999         1.67
     347.903     0.500000         1247         2.00
     377.343     0.550000         1371         2.22
     411.391     0.600000         1496         2.50
     437.503     0.650000         1621         2.86
     460.543     0.700000         1745         3.33
     479.999     0.750000         1873         4.00
     489.727     0.775000         1932         4.44
     499.455     0.800000         1994         5.00
     510.463     0.825000         2057         5.71
     517.375     0.850000         2120         6.67
     528.383     0.875000         2182         8.00
     535.039     0.887500         2217         8.89
     541.183     0.900000         2243        10.00
     549.375     0.912500         2275        11.43
     558.079     0.925000         2309        13.33
     569.855     0.937500         2337        16.00
     578.047     0.943750         2352        17.78
     585.215     0.950000         2368        20.00
     596.991     0.956250         2384        22.86
     602.623     0.962500         2400        26.67
     606.719     0.968750         2416        32.00
     609.791     0.971875         2422        35.56
     621.055     0.975000         2430        40.00
     639.487     0.978125         2438        45.71
     683.519     0.981250         2446        53.33
     723.455     0.984375         2454        64.00
     752.639     0.985938         2457        71.11
     778.239     0.987500         2461        80.00
     779.775     0.989062         2465        91.43
     782.335     0.990625         2469       106.67
     830.975     0.992188         2473       128.00
     831.487     0.992969         2475       142.22
     832.511     0.993750         2477       160.00
     869.887     0.994531         2479       182.86
     904.703     0.995313         2481       213.33
     940.031     0.996094         2483       256.00
     953.855     0.996484         2484       284.44
     955.391     0.996875         2485       320.00
     957.439     0.997266         2486       365.71
     979.967     0.997656         2487       426.67
    1146.879     0.998047         2488       512.00
    1146.879     0.998242         2488       568.89
    1150.975     0.998437         2489       640.00
    1150.975     0.998633         2489       731.43
    1160.191     0.998828         2490       853.33
    1160.191     0.999023         2490      1024.00
    1160.191     0.999121         2490      1137.78
    1161.215     0.999219         2491      1280.00
    1161.215     0.999316         2491      1462.86
    1161.215     0.999414         2491      1706.67
    1161.215     0.999512         2491      2048.00
    1161.215     0.999561         2491      2275.56
    1202.175     0.999609         2492      2560.00
    1202.175     1.000000         2492          inf
#[Mean    =      334.565, StdDeviation   =      180.574]
#[Max     =     1201.152, Total count    =         2492]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2952 requests in 1.00m, 714.94KB read
Requests/sec:     49.15
Transfer/sec:     11.90KB